Revit 2027 API
ParameterTypeId.SpliceTypeAtStart Property
 "Splice at Start"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpliceTypeAtStart { get; }
Public Shared ReadOnly Property SpliceTypeAtStart As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpliceTypeAtStart {
	ForgeTypeId^ get ();
}
static member SpliceTypeAtStart : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace